# Написать программу используя функции input() и print().
# Программа запрашивает ввести произвольную строку.
# Затем необходимо создать 2 строковые переменные, первая из которых состоит
# только из чётных символов введённой строки, а вторая состоит из введённой
# строки написанной в обратной последовательности, при этом все буквы должны
# быть написаны в верхнем регистре.
# В качестве результата вывести введённую строку и 2 получившиеся новые строки,
# каждую с новой строчки.
a = ()
b = ()
c = ()

print(a == b)
print(b == c)
print(a == c)

print(type(a))
print(type(b))
print(type(c))
print(id(a))
print(id(b))
print(id(c))

d = [1]
e = [1]

print(type(d))
print(type(e))

print(id(d))
print(id(e))

a = list(a)
b = list(b)
c = list(c)

print(a == b)
print(b == c)
print(a == c)

print(type(a))
print(type(b))
print(type(c))
print(id(a))
print(id(b))
print(id(c))

d = bool(d)
e = bool(e)

print(type(d))
print(type(e))

print(id(d))
print(id(e))